In [1]:
import pandas as pd

In [32]:
from pandas import Series,DataFrame

In [3]:
obj = pd.Series([9,5,6,3])
obj

0    9
1    5
2    6
3    3
dtype: int64

In [4]:
obj.values

array([9, 5, 6, 3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([9,-10,69,4], index=['d','b','a','c'])
obj2

d     9
b   -10
a    69
c     4
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['b']

-10

In [9]:
obj2[['a','c','b']]

a    69
c     4
b   -10
dtype: int64

In [10]:
obj2[obj2>0]

d     9
a    69
c     4
dtype: int64

In [11]:
obj2*2

d     18
b    -20
a    138
c      8
dtype: int64

In [19]:
import numpy as np

In [13]:
np.exp(obj2)

d    8.103084e+03
b    4.539993e-05
a    9.253782e+29
c    5.459815e+01
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
states = ['California','Oregon','Texas','Ohio']

In [18]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Oregon        16000.0
Texas         71000.0
Ohio          35000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Oregon        False
Texas         False
Ohio          False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Oregon         True
Texas          True
Ohio           True
dtype: bool

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
obj4

California        NaN
Oregon        16000.0
Texas         71000.0
Ohio          35000.0
dtype: float64

In [23]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [25]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [27]:
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [36]:
pip install lxml

Collecting lxml
  Downloading lxml-4.5.2-cp38-cp38-win_amd64.whl (3.5 MB)
Installing collected packages: lxml
Successfully installed lxml-4.5.2
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.2; however, version 20.2.2 is available.
You should consider upgrading via the 'c:\users\qc\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.

In [39]:
pip install --upgrade pip

Collecting pip
  Downloading pip-20.2.2-py2.py3-none-any.whl (1.5 MB)
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 20.2
    Uninstalling pip-20.2:
      Successfully uninstalled pip-20.2
Successfully installed pip-20.2.2
Note: you may need to restart the kernel to use updated packages.

In [2]:
df = pd.read_html("https://www.w3schools.com/html/html_tables.asp")
df

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
           Tag                                        Description
 0     <table>                                    Defines a table
 1        <th>                   Defines a header cell in a table
 2        <tr>                           Defines a row in a table
 3        <td>                          Defines a cell in a table
 4   <caption>                            Defines a table caption
 5  <colgroup>  Specifies a group of one or more columns in a ...
 6       <col>  Specifies column properties for each column wi...
 7     <thead>               Groups the header content in a table
 8     <tbody>                 Groups the body content in a table
 9     <tfoot>               Groups the footer content in a table]

In [3]:
df[1]

          Tag                                        Description
0     <table>                                    Defines a table
1        <th>                   Defines a header cell in a table
2        <tr>                           Defines a row in a table
3        <td>                          Defines a cell in a table
4   <caption>                            Defines a table caption
5  <colgroup>  Specifies a group of one or more columns in a ...
6       <col>  Specifies column properties for each column wi...
7     <thead>               Groups the header content in a table
8     <tbody>                 Groups the body content in a table
9     <tfoot>               Groups the footer content in a table

In [11]:
d1 = {
    "Id":[1,2,3,4,5,6],
    "Name" : ["Mohsin","Hamza","Hassan","Jawad","Saad","Nelson"],
    "Course" : ["AI","BC","CNC","IOT","AI","IOT"],
    "Fee" : [5000,3000,3000,3500,4000,5000]
}
data1 = pd.DataFrame(d1)
data1

   Id    Name Course   Fee
0   1  Mohsin     AI  5000
1   2   Hamza     BC  3000
2   3  Hassan    CNC  3000
3   4   Jawad    IOT  3500
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

# Get General Infromation from your DataFrame

#dataframe.info()
#dataframe.describe()
#dataframe.dtypes
#dataframe.columns
#dataframe.index
#dataframe.values
#dataframe.isnull()
#dataframe.isnull().sum()
#dataframe.notnull()
#dataframe.notnull().sum()
#dataframe.head(n=5)
#dataframe.tail()
#dataframe.apply()     # pass user define function

In [12]:
data1.tail(2)

   Id    Name Course   Fee
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

In [13]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      6 non-null      int64
 1   Name    6 non-null      object
 2   Course  6 non-null      object
 3   Fee     6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [14]:
data1.describe()

             Id          Fee
count  6.000000     6.000000
mean   3.500000  3916.666667
std    1.870829   917.423930
min    1.000000  3000.000000
25%    2.250000  3125.000000
50%    3.500000  3750.000000
75%    4.750000  4750.000000
max    6.000000  5000.000000

# Apply General Function on Series

#dataframe.column.apply() (pass user define function)
#dataframe.column.unique()
#dataframe.column.map() (pass dictionary (find key and replace with value))
#dataframe.column.value_counts()
#dataframe.columns.sum() #min,max,mean,std

In [15]:
data1

   Id    Name Course   Fee
0   1  Mohsin     AI  5000
1   2   Hamza     BC  3000
2   3  Hassan    CNC  3000
3   4   Jawad    IOT  3500
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

In [16]:
data1.Course.value_counts()

IOT    2
AI     2
BC     1
CNC    1
Name: Course, dtype: int64

In [17]:
data1.Fee.sum()

23500

In [18]:
data1.Course.unique()

array(['AI', 'BC', 'CNC', 'IOT'], dtype=object)

In [23]:
dmap = {
    "AI" : 0,
    "BC" : 1,
    "IOT" : 2,
    "CNC" : 3,
    np.nan : 4,
}

data1.Course.map(dmap)

0    0
1    1
2    3
3    2
4    0
5    2
Name: Course, dtype: int64

In [24]:
dic = {}

for i,v in enumerate(data1.Course.unique()):
    dic[v] = i

dic

{'AI': 0, 'BC': 1, 'CNC': 2, 'IOT': 3}

In [26]:
data1["Updated Courses"] = data1.Course.map(dic)
data1

   Id    Name Course   Fee  Updated Courses
0   1  Mohsin     AI  5000                0
1   2   Hamza     BC  3000                1
2   3  Hassan    CNC  3000                2
3   4   Jawad    IOT  3500                3
4   5    Saad     AI  4000                0
5   6  Nelson    IOT  5000                3